In [3]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\programdata\anaconda3\lib\site-packages (2.8.3)

In [4]:
import pandas
import configparser
import psycopg2

In [5]:
config = configparser.ConfigParser()
config.read('config.ini')


host = config['myaws']['host']
user = config['myaws']['user']
pwd = config['myaws']['pwd']
database = config['myaws']['database']

In [6]:
conn = psycopg2.connect(
                        host = host,
                        user = user,
                        password = pwd,
                        dbname = database
)

In [7]:
cur = conn.cursor()

#### 1)

In [8]:
sql_statement = ''' select * from
                    student_gp12

                '''

In [9]:
df = pandas.read_sql_query(sql_statement, conn)
df[:]

,email,name,major
0,owain@dukes.jmu.edu ...,Owain Scholbe ...,IA
1,scholbe@dukes.jmu.edu ...,Scholbe Owain ...,IA
2,john@dukes.jmu.edu ...,John Johnson ...,IA
3,jack@dukes.jmu.edu ...,Jack Jackson ...,IA
4,david@dukes.jmu.edu ...,David Davidson ...,IA

#### 2)

In [10]:
sql_statement2 = '''
                select 
                cname, count(semail)
                from enroll_gp12
                group by cname
                order by count(semail) desc
                limit 1

                '''

In [11]:
df = pandas.read_sql_query(sql_statement2, conn)
df[:]

                                               cname  count
0  ia261                                         ...      1

#### 3)

In [12]:
sql_statement3 = ''' select * from teacher_gp12
                    inner join course_gp12
                    on teacher_gp12.email = course_gp12.temail

                '''

In [13]:
df = pandas.read_sql_query(sql_statement3, conn)
df[:]

,email,name,office,name,room,temail
0,weixx@jmu.edu ...,Xuebin Wei ...,hhs112,ia210 ...,engeo2202,weixx@jmu.edu ...
1,marrinsp@jmu.edu ...,Stephen Marrin ...,engeo2104,ia300 ...,engeo1209,marrinsp@jmu.edu ...
2,waltontr@jmu.edu ...,Timothy Walton ...,isat326,ia261 ...,isat150,waltontr@jmu.edu ...
3,moore8ka@jmu.edu ...,Kathleen Moore ...,isat116,ia240 ...,engeo2202,moore8ka@jmu.edu ...
4,faketeacher@jmu.edu ...,Fake Teacher ...,engeo2010,ia480 ...,engeo2014,faketeacher@jmu.edu ...
5,faketeacher@jmu.edu ...,Fake Teacher ...,engeo2010,ia340 ...,engeo2010,faketeacher@jmu.edu ...

#### 4)

In [14]:
sql_statement4 = ''' select 
                    teacher_gp12.name as tname,
                    count(course_gp12.name) as course_number
                    from teacher_gp12
                    inner join course_gp12
                    on teacher_gp12.email = course_gp12.temail
                    group by teacher_gp12.name
                    order by count(course_gp12.name)
                    limit 1

                '''

In [15]:
df = pandas.read_sql_query(sql_statement4, conn)
df[:]

                                               tname  course_number
0  Timothy Walton                                ...              1

#### 5)

In [16]:
sql_statement5 = ''' 
                insert into teacher_gp12(email,name,office)
                values('{}', '{}', '{}')

                '''.format('anotherfake@jmu.edu', 'Another Fake', 'engeo2011')

In [17]:
print(sql_statement5)

                insert into teacher_gp12(email,name,office)
                values('anotherfake@jmu.edu', 'Another Fake', 'engeo2011')

In [18]:
cur.execute(sql_statement5)

In [19]:
conn.commit()

In [20]:
df = pandas.read_sql_query('select * from teacher_gp12', conn)
df[:]

,email,name,office
0,weixx@jmu.edu ...,Xuebin Wei ...,hhs112
1,marrinsp@jmu.edu ...,Stephen Marrin ...,engeo2104
2,moore8ka@jmu.edu ...,Kathleen Moore ...,isat116
3,waltontr@jmu.edu ...,Timothy Walton ...,isat326
4,faketeacher@jmu.edu ...,Fake Teacher ...,engeo2010
5,anotherfake@jmu.edu ...,Another Fake ...,engeo2011

In [21]:
sql_statement6 = ''' 
                insert into course_gp12(name,room,temail)
                values('{}', '{}', '{}')

                '''.format('ia250', 'engeo1209', 'anotherfake@jmu.edu')

In [22]:
cur.execute(sql_statement6)

In [23]:
conn.commit()

In [24]:
df = pandas.read_sql_query('select * from course_gp12', conn)
df[:]

,name,room,temail
0,ia210 ...,engeo2202,weixx@jmu.edu ...
1,ia300 ...,engeo1209,marrinsp@jmu.edu ...
2,ia261 ...,isat150,waltontr@jmu.edu ...
3,ia240 ...,engeo2202,moore8ka@jmu.edu ...
4,ia480 ...,engeo2014,faketeacher@jmu.edu ...
5,ia340 ...,engeo2010,faketeacher@jmu.edu ...
6,ia250 ...,engeo1209,anotherfake@jmu.edu ...

#### 6)

In [25]:
sql_statement7 = ''' 
                update course_gp12
                set temail = 'anotherfake@jmu.edu'
                where temail = 'weixx@jmu.edu'

                '''

In [26]:
cur.execute(sql_statement7)

In [27]:
conn.commit()

In [28]:
df = pandas.read_sql_query('select * from course_gp12', conn)
df[:]

,name,room,temail
0,ia300 ...,engeo1209,marrinsp@jmu.edu ...
1,ia261 ...,isat150,waltontr@jmu.edu ...
2,ia240 ...,engeo2202,moore8ka@jmu.edu ...
3,ia480 ...,engeo2014,faketeacher@jmu.edu ...
4,ia340 ...,engeo2010,faketeacher@jmu.edu ...
5,ia250 ...,engeo1209,anotherfake@jmu.edu ...
6,ia210 ...,engeo2202,anotherfake@jmu.edu ...

In [29]:
sql_statement8 = ''' 
                delete from teacher_gp12
                where email = 'weixx@jmu.edu'

                '''

In [30]:
cur.execute(sql_statement8)

In [31]:
conn.commit()

In [32]:
df = pandas.read_sql_query('select * from teacher_gp12', conn)
df[:]

,email,name,office
0,marrinsp@jmu.edu ...,Stephen Marrin ...,engeo2104
1,moore8ka@jmu.edu ...,Kathleen Moore ...,isat116
2,waltontr@jmu.edu ...,Timothy Walton ...,isat326
3,faketeacher@jmu.edu ...,Fake Teacher ...,engeo2010
4,anotherfake@jmu.edu ...,Another Fake ...,engeo2011